InformationRegisters/ЛБ_ОтменыОперацийЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтменыОперацийЗБ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтмененныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроцентам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОсновномуДолгу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаРеестраПлатежей/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет; 
		ЭтаФорма.Заголовок = "Дополнительные соглашения к ЗБ № " + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета) + " клиент " + ЛБ_ОбщийМодуль.ПолучитьФИО(ЗалоговыйБилет.Залогодатель);		
		ЗаполнитьТаблицуДопСоглашений();
	Иначе     
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция  ПолучитьНачислениеОплатуЗБ(Дата)
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЛБ_РасчетыСКлиентамиОбороты.ВидРасчета КАК ВидРасчета,
	              |	СУММА(ЛБ_РасчетыСКлиентамиОбороты.СуммаПриход) КАК Начислено,
	              |	СУММА(ЛБ_РасчетыСКлиентамиОбороты.СуммаРасход) КАК Оплачено
	              |ИЗ
	              |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Обороты(, &Дата, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиОбороты
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ЛБ_РасчетыСКлиентамиОбороты.ВидРасчета"; 
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции 

&НаСервере
Процедура ЗаполнитьТаблицуДопСоглашений()
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК ДокументОплаты,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения КАК НомерДС
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
	               |	И ЛБ_СостояниеЗалоговогоБилета.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов)";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	НомерДС = 0; 
	Для каждого стр Из ТаблицаЗапроса цикл 
		Если ПолучитьДокументОтмены(стр.ДокументОплаты) Тогда
			Продолжить;
		КонецЕсли;	
		Если НЕ НомерДС = Стр.НомерДС Тогда
			НомерДС = Стр.НомерДС; 
			НоваяСтр = ТаблицаДопСоглашений.Добавить(); 
			НоваяСтр.ДокументОплаты = Стр.ДокументОплаты; 
			НоваяСтр.НомерДС = Стр.НомерДС; 
			НоваяСтр.ДатаОплаты = Стр.ДокументОплаты.Дата; 
			НоваяСтр.СуммаОплаты = Стр.ДокументОплаты.СуммаОплаты;  
			НоваяСтр.СуммаОплатыСсуда = Стр.ДокументОплаты.СуммаОплатыСсуда;
            НоваяСтр.СуммаОплатыПроценты = Стр.ДокументОплаты.СуммаОплатыПроценты;
			
			ТаблицаОплат = ПолучитьНачислениеОплатуЗБ(НоваяСтр.ДатаОплаты);
			НачисленоПроценты = 0; 
			ОплаченоПроценты = 0;

			Отбор = Новый Структура;
			Отбор.Вставить("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);
			Строки = ТаблицаОплат.Найтистроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = строки.получить(0);
				НачисленоПроценты = Стр.Начислено; 
				ОплаченоПроценты = Стр.Оплачено;
			КонецЕсли;	
						
			ОплаченоЗайм = 0;

			Отбор = Новый Структура;
			Отбор.Вставить("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу);
			Строки = ТаблицаОплат.Найтистроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = строки.получить(0);
				ОплаченоЗайм = Стр.Оплачено;
			КонецЕсли;	

            НоваяСтр.ДолгЗайм  = ЗалоговыйБилет.СуммаСсуды - ОплаченоЗайм; 
			НоваяСтр.ДолгПроценты = НачисленоПроценты - ОплаченоПроценты;
		КонецЕсли;	
	КонецЦикла; 
	ТаблицаДопСоглашений.Сортировать("ДатаОплаты Убыв");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДС(Команда)    
	ТекСтрока = Элементы.ТаблицаДопСоглашений.ТекущиеДанные;
	Если НЕ ТекСтрока  = неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "ДополнительноеСоглашение"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ТекСтрока.ДокументОплаты);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
	КонецЕсли;	
КонецПроцедуры
